#1.逻辑运算符
#表达式的执行顺序是从左到右的；如果逻辑表达式的真假已经可以确定，则不会再判断剩余的表达式；
#最后一个表达式的值为整个逻辑表达式的值；

# ||，如果左边为真则直接返回左边的值，否则计算右边的值
ret = "abc" || "iii"
p ret
ret = nil || false
p ret

# &&,只有左边的判断结果为真时，才会判断右边的值
item = nil
ary = ["a","b"]
if ary
    item = ary[0]
end
p item
# equal
item = ary && ary[0]
p item

#2.条件运算符：条件？表达式1：表达式2
a = 1
b = 2
v = (a > b) ? a : b
p v

#3.范围运算符:range对象
a = Range.new(1,10)
b = 1 .. 10
p [a,b]
#"x .. y"与"x ... y"的区别在于前者的方位是从x到y；而后者的范围是从x到y的前一个元素;
p (5 .. 10).to_a
p (5 ... 10).to_a #不包含10

#4.可以根据添加括号来更改优先级，当存在多个括号时，从最内侧的括号开始执行；

#5.定义运算符
#不能重定义的运算符： "::""，"&&"，"||",.."，"...","?:","not","=","and","or"
